//************************************************************
//  Copyright (c) 深圳市赛元微电子有限公司
//	文件名称	: PWM.c
//	作者		: 
//	模块功能	:PWM的使用
//	局部函数列表:
//  最后更正日期:
// 	版本		:
// 	更改记录	:rom前256byte禁止查表,因此在编译的时候，设置keil->option for Target->BL51 Locate->Code Range:0x100
//*************************************************************

#include "h\SC91F736_C.h"
#define  tst  P30
//*************************************************************
// 函数名	：void PWMinit(void)
// 作者		：
// 功能		：PWM0/1分别输出1/2、1/4 Duty
// 参数		：无
// 返回值	：无
// 调用全局变量：无
// 修改全局变量：无
// 备注		：
//**************************************************************
void PWMinit(void)
{
 	PWMCFG = 0x03;			// - - 00 - 011  PWM0/1输出不反向,选择PWM时钟源为Fosc/8 = 2MHZ;1/2us
 	PWMPRD = 99;			//	PWM周期=(99+1)*(1/2us)=50us	;PWM0/1共用同一个周期
 	PWMDTY0 = 50;			//PWM0的Duty = 50/100 =1/2
 	PWMDTY1 = 25;			//PWM1的Duty = 25/100  =1/4
 	PWMCR = 0x85;			// 10-- 0101   开PWM,切换PWM0/1输出口
}
//*************************************************************
// 函数名	：void PWM() interrupt 5
// 作者		：
// 功能		：PWM产生50us的中断
// 参数		：无
// 返回值	：无
// 调用全局变量：无
// 修改全局变量：无
// 备注		：PWM中断需用户软件清除
//**************************************************************
void PWM() interrupt 5
{
	PWMIF=0; 				//PWM计数溢出，需用户自行清除
	tst =~tst;
}
void main()
{
	RSTCFG=0x2A;     			//切换RstPin为GPIO,lvr选择3.5V复位
	P3CFG0=0X00;
	WDTCR = 0x90;				//1--1 -- 00    开WDT,WDT清0,WDT 262ms溢出;烧录时，可Code Option选择ENWDT
	PWMinit();
	EPWM = 1;				//使能PWM中断
	EA=1;						//开总中断
	while(1)
	{
		WDTCR = 0x90;				//1--1 -- 00    开WDT,WDT清0,WDT 262ms溢出;烧录时，可Code Option选择ENWDT
	}
}